ERP/src/DataProcessors/СформироватьПодписку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СформироватьПодписку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПодписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодписки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегулярногоПлатежа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбранныйТариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СформированныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументСсылка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ERP/src/InformationRegisters/ИсторияИзмененийОсновныхПрайсЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененийОсновныхПрайсЛистов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрайсЛист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсЛист</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланПодписки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/Documents/Подписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Подписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеПодписчиков</xr:Item>
				<xr:Item>InformationRegister.ПодпискиПериодДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПодписки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникПодписки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реферал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промокод</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПромокодСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегулярногоПлатежа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/Documents/СчетНаОплатуПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПодписки</Name>
			<BasedOn>
				<xr:Item>Document.Подписка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Подписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифКОплате</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/Documents/ОплатаПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОплатаПодписки</Name>
			<BasedOn>
				<xr:Item>Document.СчетНаОплатуПодписки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыручкаОборот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПодписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Подписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифКОплате</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тариф</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредства</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERP/src/DataProcessors/СформироватьПодписку/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработкаСобытий

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	Объект.ДатаПодписки = ТекущаяДата();	
КонецПроцедуры

&НаКлиенте
Процедура ПланПодпискиПриИзменении(Элемент)
	
	ОчиститьВсеДанныеПодписки();
	
	Если Не ЗначениеЗаполнено(Объект.ПланПодписки) Тогда
		
		ЭтотОбъект.Элементы.ГруппаПодписка.Доступность = Ложь;
			
	Иначе	
			
		УстановитьОсновнойПрайсНаДату();
		
		Если НЕ ЗначениеЗаполнено(ПрайсЛист) Тогда
			
			Объект.ПланПодписки = Неопределено;
			Сообщить("Необходимо установить основной прайс-лист для продолжения работы!");
			ЭтотОбъект.Элементы.ГруппаПодписка.Доступность = Ложь;
			
		Иначе
			
			ЭтотОбъект.Элементы.ГруппаПодписка.Доступность = Истина;

		КонецЕсли;
	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПромокодПриИзменении(Элемент)
	
	ОчиститьТарифИСумму();
	УстановитьПрайсЛистПоПромокоду();
	ПроверитьДоступностьФормирования();

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныйТарифПриИзменении(Элемент)
	
	ВыбранныйТарифПриИзмененииНаСервере();
	ПроверитьДоступностьФормирования();

КонецПроцедуры

&НаКлиенте
Процедура ДатаПодпискиПриИзменении(Элемент)
	
	ОчиститьТарифИСумму();
	Сообщить("Необходимо заново выбрать тариф");

	
	Если ЗначениеЗаполнено(Объект.Промокод) Тогда
		
		УстановитьПрайсЛистПоПромокоду();
		
	Иначе
		
		УстановитьОсновнойПрайсНаДату();
	
	КонецЕсли;
	
	ПроверитьДоступностьФормирования();

КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ПроверитьДоступностьФормирования();

КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьДоступностьФормирования()
	
	Если ОбщегоНазначения.ДатаЗаполнена(Объект.ДатаПодписки) И ЗначениеЗаполнено(Объект.Клиент) И ЗначениеЗаполнено(Объект.ВыбранныйТариф) Тогда
		
		ЭтотОбъект.Элементы.ФормаСформировать.Доступность = Истина;	
		
	Иначе
		
		ЭтотОбъект.Элементы.ФормаСформировать.Доступность = Ложь;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВыбранныйТарифПриИзмененииНаСервере()

	СтрокаТарифа = ПрайсЛист.ПолучитьОбъект().ПолучитьРасценкуПоТарифу(Объект.ВыбранныйТариф);

	Если СтрокаТарифа = Неопределено Тогда
	 
		Сообщить("Данный тариф не найден в текущем прайс-листе");	
		ОчиститьТарифИСумму();

	Иначе
		
		Объект.СуммаРегулярногоПлатежа = СтрокаТарифа.Сумма;
		
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура УстановитьПрайсЛистПоПромокоду()
	
	Если НЕ ОбщегоНазначения.ДатаЗаполнена(Объект.ДатаПодписки) Тогда
		
		Сообщить("Дата подписки не заполнена, не возможно проверить промокод!");
		ПромокодНайден = Ложь;
		Возврат;
		
	КонецЕсли;
	
	ДанныеПромокода = ПромокодыНаСервере.ПолучитьДанныеПоПромокоду(Объект.Промокод, Объект.ПланПодписки, Объект.ДатаПодписки);
	
	ПрайсЛист = ДанныеПромокода.ПрайсЛист;
	Реферал = ДанныеПромокода.Реферал;
	ИсточникПодписки = ДанныеПромокода.ИсточникПодписки;
	
	Если НЕ ЗначениеЗаполнено(ПрайсЛист) Тогда
		ПромокодНайден = Ложь;
		УстановитьОсновнойПрайсНаДату();
	Иначе
		ПромокодНайден = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойПрайсНаДату()
	
	ПрайсЛист = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.ПолучитьОсновнойПрайсЛистНаДату(Объект.ДатаПодписки, Объект.ПланПодписки);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТарифИСумму()
	
	Объект.ВыбранныйТариф = Неопределено;
	Объект.СуммаРегулярногоПлатежа = 0;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеДанныеПодписки()
	
	Объект.Промокод = "";
	ПрайсЛист = Неопределено;
	ОчиститьТарифИСумму();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСформированныйДокумент(Документ)
	
	НовыйДок = Объект.СформированныеДокументы.Добавить();
	НовыйДок.ДокументСсылка = Документ.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Объект.СформированныеДокументы.Очистить();
	
	НоваяПодписка = Документы.Подписка.СоздатьДокумент();	
	
	НоваяПодписка.Клиент = Объект.Клиент;
	НоваяПодписка.ДатаНачала = Объект.ДатаПодписки;
	НоваяПодписка.ИсточникПодписки = ИсточникПодписки;
	НоваяПодписка.Реферал = Реферал;
	НоваяПодписка.Промокод = Объект.Промокод;
	НоваяПодписка.Тариф = Объект.ВыбранныйТариф;
	НоваяПодписка.СтавкаТарифа = Объект.СуммаРегулярногоПлатежа;
	
	НоваяПодписка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	ДобавитьСформированныйДокумент(НоваяПодписка);
	
	НовыйСчет = Документы.СчетНаОплатуПодписки.СоздатьДокумент();
	
	НовыйСчет.Контрагент = Объект.Клиент;
	НовыйСчет.Подписка = НоваяПодписка.Ссылка;
	НовыйСчет.КрайнийСрокОплаты = Объект.ДатаПодписки;	
	НовыйСчет.ТарифКОплате = Объект.ВыбранныйТариф;
	НовыйСчет.СуммаДокумента = Объект.СуммаРегулярногоПлатежа;
	
	НовыйСчет.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	ДобавитьСформированныйДокумент(НовыйСчет);
	
	НоваяОплата = Документы.ОплатаПодписки.СоздатьДокумент();
	
	НоваяОплата.СчетНаОплату = НовыйСчет.Ссылка;
	НоваяОплата.Контрагент = Объект.Клиент;
	НоваяОплата.Подписка = НоваяПодписка.Ссылка;
	НоваяОплата.ТарифКОплате = Объект.ВыбранныйТариф;
	НоваяОплата.СуммаДокумента = Объект.СуммаРегулярногоПлатежа;
	
	НоваяОплата.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	ДобавитьСформированныйДокумент(НоваяОплата);
	
КонецПроцедуры

#КонецОбласти
